; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v3 ?v8)
             (pred_11 ?v5 ?v2)
             (pred_9 ?v3 ?v2)
             (pred_2 ?v1 ?v3 )
	     (pred_5 ?v3)
             (pred_12 ?v6)
             (pred_10 ?v5)
             (pred_3 ?v2)
             (pred_6 ?v3)
             (pred_1 ?v5)
             (pred_8 ?v3)
             (pred_7 ))



(:action op_5
:parameters (?v12 ?v11 ?v10 ?v7)
:precondition (and (pred_12 ?v12) (pred_12 ?v11) (pred_10 ?v10) (pred_3 ?v7)
          (pred_4 ?v12 ?v11) (pred_11 ?v10 ?v7)
                   (pred_9 ?v11 ?v7) (pred_5 ?v12) 
                   (pred_6 ?v11) (pred_1 ?v10))
:effect (and  (pred_8 ?v11) (not (pred_6 ?v11))))


(:action op_2
:parameters (?v12 ?v13)
:precondition (and (pred_12 ?v12) (pred_12 ?v13)
               (pred_5 ?v12) (pred_4 ?v12 ?v13) (pred_8 ?v13))
:effect (and (pred_5 ?v13) (not (pred_5 ?v12))))

(:action op_1
:parameters (?v12 ?v10)
:precondition (and (pred_12 ?v12) (pred_10 ?v10) 
                  (pred_5 ?v12) (pred_2 ?v10 ?v12) (pred_7 ))
:effect (and (pred_1 ?v10)
   (not (pred_2 ?v10 ?v12)) (not (pred_7 ))))


(:action op_3
:parameters (?v12 ?v4 ?v9)
:precondition (and (pred_12 ?v12) (pred_10 ?v4) (pred_10 ?v9)
                  (pred_5 ?v12) (pred_1 ?v9) (pred_2 ?v4 ?v12))
:effect (and (pred_1 ?v4) (pred_2 ?v9 ?v12)
        (not (pred_1 ?v9)) (not (pred_2 ?v4 ?v12))))

(:action op_4
:parameters (?v12 ?v10)
:precondition (and (pred_12 ?v12) (pred_10 ?v10) 
                  (pred_5 ?v12) (pred_1 ?v10))
:effect (and (pred_7 ) (pred_2 ?v10 ?v12) (not (pred_1 ?v10)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_26 obj_22 obj_09 obj_12 obj_19 obj_29 obj_03 obj_16 obj_18 obj_25 obj_15 obj_05 obj_30 obj_07 obj_23 obj_14 obj_20 obj_10 obj_27 obj_02 obj_11 obj_04 obj_08 obj_13
    obj_21 obj_24 obj_17
    obj_31 obj_28 obj_06
    )

    (:init
       (pred_7)

       (pred_12 obj_01)
       (pred_12 obj_26)
       (pred_12 obj_22)
       (pred_12 obj_09)
       (pred_12 obj_12)
       (pred_12 obj_19)
       (pred_12 obj_29)
       (pred_12 obj_03)
       (pred_12 obj_16)
       (pred_12 obj_18)
       (pred_12 obj_25)
       (pred_12 obj_15)
       (pred_12 obj_05)
       (pred_12 obj_30)
       (pred_12 obj_07)
       (pred_12 obj_23)
       (pred_12 obj_14)
       (pred_12 obj_20)
       (pred_12 obj_10)
       (pred_12 obj_27)
       (pred_12 obj_02)
       (pred_12 obj_11)
       (pred_12 obj_04)
       (pred_12 obj_08)
       (pred_12 obj_13)
       (pred_3 obj_21)
       (pred_3 obj_24)
       (pred_3 obj_17)
       (pred_10 obj_31)
       (pred_10 obj_28)
       (pred_10 obj_06)

       (pred_4 obj_01 obj_19)
       (pred_4 obj_01 obj_26)
       (pred_4 obj_26 obj_29)
       (pred_4 obj_26 obj_22)
       (pred_4 obj_26 obj_01)
       (pred_4 obj_22 obj_03)
       (pred_4 obj_22 obj_09)
       (pred_4 obj_22 obj_26)
       (pred_4 obj_09 obj_16)
       (pred_4 obj_09 obj_12)
       (pred_4 obj_09 obj_22)
       (pred_4 obj_12 obj_18)
       (pred_4 obj_12 obj_09)
       (pred_4 obj_19 obj_25)
       (pred_4 obj_19 obj_29)
       (pred_4 obj_19 obj_01)
       (pred_4 obj_29 obj_15)
       (pred_4 obj_29 obj_03)
       (pred_4 obj_29 obj_26)
       (pred_4 obj_29 obj_19)
       (pred_4 obj_03 obj_05)
       (pred_4 obj_03 obj_16)
       (pred_4 obj_03 obj_22)
       (pred_4 obj_03 obj_29)
       (pred_4 obj_16 obj_30)
       (pred_4 obj_16 obj_18)
       (pred_4 obj_16 obj_09)
       (pred_4 obj_16 obj_03)
       (pred_4 obj_18 obj_07)
       (pred_4 obj_18 obj_12)
       (pred_4 obj_18 obj_16)
       (pred_4 obj_25 obj_23)
       (pred_4 obj_25 obj_15)
       (pred_4 obj_25 obj_19)
       (pred_4 obj_15 obj_14)
       (pred_4 obj_15 obj_05)
       (pred_4 obj_15 obj_29)
       (pred_4 obj_15 obj_25)
       (pred_4 obj_05 obj_20)
       (pred_4 obj_05 obj_30)
       (pred_4 obj_05 obj_03)
       (pred_4 obj_05 obj_15)
       (pred_4 obj_30 obj_10)
       (pred_4 obj_30 obj_07)
       (pred_4 obj_30 obj_16)
       (pred_4 obj_30 obj_05)
       (pred_4 obj_07 obj_27)
       (pred_4 obj_07 obj_18)
       (pred_4 obj_07 obj_30)
       (pred_4 obj_23 obj_02)
       (pred_4 obj_23 obj_14)
       (pred_4 obj_23 obj_25)
       (pred_4 obj_14 obj_11)
       (pred_4 obj_14 obj_20)
       (pred_4 obj_14 obj_15)
       (pred_4 obj_14 obj_23)
       (pred_4 obj_20 obj_04)
       (pred_4 obj_20 obj_10)
       (pred_4 obj_20 obj_05)
       (pred_4 obj_20 obj_14)
       (pred_4 obj_10 obj_08)
       (pred_4 obj_10 obj_27)
       (pred_4 obj_10 obj_30)
       (pred_4 obj_10 obj_20)
       (pred_4 obj_27 obj_13)
       (pred_4 obj_27 obj_07)
       (pred_4 obj_27 obj_10)
       (pred_4 obj_02 obj_11)
       (pred_4 obj_02 obj_23)
       (pred_4 obj_11 obj_04)
       (pred_4 obj_11 obj_14)
       (pred_4 obj_11 obj_02)
       (pred_4 obj_04 obj_08)
       (pred_4 obj_04 obj_20)
       (pred_4 obj_04 obj_11)
       (pred_4 obj_08 obj_13)
       (pred_4 obj_08 obj_10)
       (pred_4 obj_08 obj_04)
       (pred_4 obj_13 obj_27)
       (pred_4 obj_13 obj_08)
       (pred_6 obj_05)
       (pred_6 obj_19)
       (pred_6 obj_14)
       (pred_9  obj_05 obj_21)
       (pred_9  obj_19 obj_24)
       (pred_9  obj_14 obj_17)
       (pred_8 obj_01)
       (pred_8 obj_26)
       (pred_8 obj_22)
       (pred_8 obj_09)
       (pred_8 obj_12)
       (pred_8 obj_29)
       (pred_8 obj_03)
       (pred_8 obj_16)
       (pred_8 obj_18)
       (pred_8 obj_25)
       (pred_8 obj_15)
       (pred_8 obj_30)
       (pred_8 obj_07)
       (pred_8 obj_23)
       (pred_8 obj_20)
       (pred_8 obj_10)
       (pred_8 obj_27)
       (pred_8 obj_02)
       (pred_8 obj_11)
       (pred_8 obj_04)
       (pred_8 obj_08)
       (pred_8 obj_13)

       (pred_11  obj_31 obj_21)
       (pred_11  obj_28 obj_24)
       (pred_11  obj_06 obj_17)
       (pred_2 obj_31 obj_11)
       (pred_2 obj_28 obj_01)
       (pred_2 obj_06 obj_10)
       (pred_5 obj_22)
    )

    (:goal (and
       (pred_2 obj_31 obj_15)
       (pred_2 obj_28 obj_03)
    ))
(:constraints
  (always (not (pred_5 obj_29)))
)
)

; plan
1. (op_2 obj_22 obj_26)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_26)
   goals met: 0 of 2
2. (op_2 obj_26 obj_01)
   deleted: (pred_5 obj_26)
   added: (pred_5 obj_01)
   goals met: 0 of 2
3. (op_1 obj_01 obj_28)
   deleted: (pred_2 obj_28 obj_01) (pred_7)
   added: (pred_1 obj_28)
   goals met: 0 of 2
4. (op_2 obj_01 obj_26)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_26)
   goals met: 0 of 2
5. (op_2 obj_26 obj_22)
   deleted: (pred_5 obj_26)
   added: (pred_5 obj_22)
   goals met: 0 of 2
6. (op_2 obj_22 obj_03)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_03)
   goals met: 0 of 2
7. (op_4 obj_03 obj_28)
   deleted: (pred_1 obj_28)
   added: (pred_7) (pred_2 obj_28 obj_03)
   goals met: 1 of 2
8. (op_2 obj_03 obj_16)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_16)
   goals met: 1 of 2
9. (op_2 obj_16 obj_30)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_30)
   goals met: 1 of 2
10. (op_2 obj_30 obj_10)
   deleted: (pred_5 obj_30)
   added: (pred_5 obj_10)
   goals met: 1 of 2
11. (op_1 obj_10 obj_06)
   deleted: (pred_2 obj_06 obj_10) (pred_7)
   added: (pred_1 obj_06)
   goals met: 1 of 2
12. (op_2 obj_10 obj_20)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_20)
   goals met: 1 of 2
13. (op_2 obj_20 obj_04)
   deleted: (pred_5 obj_20)
   added: (pred_5 obj_04)
   goals met: 1 of 2
14. (op_2 obj_04 obj_11)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_11)
   goals met: 1 of 2
15. (op_5 obj_11 obj_14 obj_06 obj_17)
   deleted: (pred_6 obj_14)
   added: (pred_8 obj_14)
   goals met: 1 of 2
16. (op_3 obj_11 obj_31 obj_06)
   deleted: (pred_1 obj_06) (pred_2 obj_31 obj_11)
   added: (pred_1 obj_31) (pred_2 obj_06 obj_11)
   goals met: 1 of 2
17. (op_2 obj_11 obj_14)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_14)
   goals met: 1 of 2
18. (op_2 obj_14 obj_15)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_15)
   goals met: 1 of 2
19. (op_4 obj_15 obj_31)
   deleted: (pred_1 obj_31)
   added: (pred_7) (pred_2 obj_31 obj_15)
   goals met: 2 of 2
